{
    "discussionId": "",
    "files": [
        {
            "authorId": "deleted",
            "description": "diagram showing the general layout/design of the SCP Conversion Project",
            "id": "designLayout.svg",
            "name": "designLayout.svg",
            "timeStamp": "2147483647",
            "url": "N/A"
        }
    ],
    "id": "CUSTOM-FRONT-PAGE",
    "name": "__front-page",
    "parent": "",
    "revisions": [
        {
            "authorId": "deleted",
            "changeMessage": "page created",
            "changeType": "new page created",
            "id": "CUSTOM-FRONT-PAGE-REVISION",
            "sourceCode": "[[div style=\"text-align: center; color: #600;\"]]\n[[div class=\"unmargined\"]]\nWARNING: THIS SCP CONVERSION FOUNDATION PROJECT IS\n[[/div]]\n[[div class=\"unmargined\" style=\"font-size: 400%; font-weight: bold; margin: 2px 0 5px;\"]]\nUNOFFICIAL\n[[/div]]\n[[div class=\"unmargined\"]]\nAND HAS NOT BEEN BACKED BY THE SCP WIKI OR IT'S STAFF.\nIF YOU'RE LOOKING FOR THE OFFICIAL WIKI PLEASE GO [http://www.scp-wiki.net/ HERE].\n[[/div]]\n[[/div]]\n-----------------------\n+ SCP Conversion Project\n**An Open-Source Re-Implementation of the SCP Wiki**\n\n++ What is this?\nThis website is an [https://github.com/danielbatterystapler/SCP_Conversion_Project open-source], view-only reimplementation and rehosting of the [http://www.scp-wiki.net/ SCP Wiki]. It is completely independent of Wikidot, the hosting provider for the SCP Wiki -- meaning that if Wikidot stopped existing tomorrow, this website would continue existing as if nothing happened at all.\n\nUnlike a traditional site mirror/archive, which merely downloads all of the pages as you see them, this website is a //reimplementation// of the SCP Wiki. The pages are saved not as their viewable HTML but as their author-written source code and translated back as you, the website reader, looks at them. This is an important distinction as it means that the pages don't need to be converted into exactly what they look like on the official SCP Wiki -- new features can be added and behaviors can be tweaked.\n\nIf you just want to take a look around you can get started [[[main|here]]] on the main page that we're all familiar with.\n\n++ Feature List\n* Archives of all pages(SCPs, tales, author pages, etc.)\n* Full history for all pages\n* All votes on all pages[[footnote]]page votes are only updated if the page itself is updated, so they are most likely very out of date[[/footnote]]\n* Custom page formatter with almost complete compatability\n* Archive of the entire forum(discussion threads, author introductions, etc.)[[footnote]]mostly text-only and post history is not yet saved[[/footnote]]\n* Auto-updating in step with the official SCP Wiki[[footnote]]changes made on the SCP Wiki might take a couple days before being carried over[[/footnote]]\n\n++ New Features\n* Data Visualizations: See the large-scale structure of the SCP Wiki!\n* [[[scp-262|Page Previews]]]: Know what a page is without having to click on it!\n* [/__front-page/showAnnotatedSource Annotated Source Code]: See how a page is being translated into the final document!\n* PDF Output: Want to have a copy of a page to read offline? How about the entire Wiki?\n* Secure, HTTPS Connection\n\n++ Project Foundation\n[http://www.scp-wiki.net/forum/t-5648716/pf-information-and-faq Project Foundation] is the SCP Wiki's plan for migrating off of the Wikidot platform and onto something more fitting and more permanent. This website, while a partial remake of the SCP Wiki, is not at all related to Project Foundation -- none of the SCP Wiki authors, admins, or staff of any kind have officially backed this SCP Conversion Project. Project Foundation is also a much larger effort covering administration, financing, and even legal matters on top of the actual software and hardware of the new wiki -- not to mention having more than one person behind it.\n\nThe SCP Conversion Project is focused on just the codebase itself and, unlike Project Foundation, currently has no plans to make this website editable and especially no plans for a full site-wide migration. This website exists in parallel as a companion with the SCP Wiki, not in competition with it or as a replacement. This website does have features useful to authors, such as [/__front-page/showAnnotatedSource annotated source code], but if you are writing a page you need to do that on the official [http://www.scp-wiki.net/ SCP Wiki].\n\nThat said, it is not lost on me that the goals of the SCP Conversion Project do overlap with the goals of Project Foundation on the codebase front and that they might be able to work together in the future, but that would be a decision made by the SCP Wiki staff.\n\n++ How It All Works\nThe following is a diagram showing an overview of how the website works, for a more full explanation refer to the documentation on [https://github.com/danielbatterystapler/SCP_Conversion_Project Github]\n[[image designLayout.svg]]\n\n++ Contact Me\nCurrently I am the only person who is a part of the \"SCP Conversion Project\" and I work on it during my free time. Bugs can be reported on the [https://github.com/danielbatterystapler/SCP_Conversion_Project project's Github]. If you don't have a github, or if for some reason you need to contact me directly, you can send emails to danielbatterystapler+scp@gmail.com.\n\n\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n _\n\n\n",
            "timeStamp": "2147483647",
            "title": ""
        }
    ],
    "tags": [],
    "votes": []
}